package com.example.rental_point;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.EditText;
import android.widget.TableLayout;
import android.widget.TableRow;
import android.widget.TextView;

public class OrdersActivity extends AppCompatActivity {


    static String[] string_date = new String[]{"2022-03-12 09:10","2022-03-13 10:10","2022-03-14 11:10","2022-03-15 12:10","2022-03-16 13:10","2022-03-17 14:10","2022-03-18 15:10","2022-03-19 16:10","2022-03-20 10:00","2022-03-21 11:00","2022-03-22 12:00","2022-03-23 13:00","2022-03-24 14:00","2022-03-25 15:00","2022-03-26 16:00","2022-03-27 17:00","2022-03-28 18:00","2022-03-29 19:00","2022-03-30 12:30","2022-03-31 13:30","2022-04-01 14:30","2022-04-01 15:15","2022-04-02 15:30","2022-04-02 15:30","2022-04-02 16:15","2022-04-03 10:45","2022-04-03 16:30","2022-04-03 16:30","2022-04-04 11:45","2022-04-04 17:30","2022-04-04 17:30","2022-04-05 10:15","2022-04-05 12:45","2022-04-05 18:30","2022-04-06 11:15","2022-04-06 13:45","2022-04-06 15:30","2022-04-07 12:15","2022-04-07 14:45","2022-04-07 16:30","2022-04-08 13:15","2022-04-08 17:30","2022-04-09 14:15","2022-04-09 18:30","2022-04-10 19:30","2022-04-11 10:30","2022-04-12 11:30","2022-04-13 12:30","2022-04-14 13:30","2022-04-15 14:30","2022-11-17 01:31","2022-11-17 01:53","2022-11-17 01:54","2022-11-17 01:55","2022-11-17 13:58","2022-11-17 14:45","2022-11-17 14:54"};
    static String[] string_state = new String[]{"Фролов Андрей Иванович","Николаев Даниил Всеволодович","Снегирев Макар Иванович","Иванов Иван Ильич","Филиппова Анна Глебовна","Иванов Михаил Владимирович","Власов Дмитрий Александрович","Серова Екатерина Львовна","Борисова Ирина Ивановна","Зайцев Никита Артёмович","Медведев Святослав Евгеньевич","Коротков Кирилл Алексеевич","Калашникова Арина Максимовна","Минина Таисия Кирилловна","Наумов Серафим Романович","Воробьева Василиса Евгеньевна","Калинин Александр Андреевич","Кузнецова Милана Владиславовна","Фирсов Егор Романович","Зимина Агния Александровна","Титов Андрей Глебович","Соболева Николь Фёдоровна","Захарова Полина Яновна","Орлов Николай Егорович","Тихонова Анна Львовна","Кузнецова Ульяна Савельевна","Зайцев Владимир Давидович","Кузнецова Аиша Михайловна","Смирнова Анна Германовна","Иванов Виталий Даниилович","Куликов Никита Георгиевич","Захаров Матвей Романович","Черепанова Анна Давидовна","Карпова София Егоровна","Иванов Степан Степанович","Григорьев Максим Кириллович","Смирнова Дарья Макаровна","Ткачева Милана Тимуровна","Голубев Даниэль Александрович","Абрамова Александра Мироновна","Семенов Даниил Иванович","Наумов Руслан Михайлович","Виноградов Вячеслав Дмитриевич","Бочаров Никита Матвеевич","Соловьев Давид Ильич","Васильева Валерия Дмитриевна","Макарова Василиса Андреевна","Алексеев Матвей Викторович","Никитина Полина Александровна","Окулова Олеся Алексеевна","Фролов Андрей Иванович","Фролов Андрей Иванович","Фролов Андрей Иванович","Фролов Андрей Иванович","Фролов Андрей Иванович","Фролов Андрей Иванович","Фролов Андрей Иванович"};
    static String[] string_status = new String[]{"Новая","В прокате","В прокате","Новая","Закрыта","Новая","Новая","В прокате","В прокате","Новая","Закрыта","В прокате","В прокате","В прокате","Закрыта","Новая","В прокате","В прокате","Новая","Новая","Закрыта","В прокате","В прокате","Новая","В прокате","В прокате","В прокате","Новая","Закрыта","Закрыта","В прокате","В прокате","Новая","В прокате","Новая","Новая","В прокате","Закрыта","Новая","В прокате","В прокате","Закрыта","В прокате","Новая","В прокате","В прокате","Новая","Новая","Новая","В прокате","Новая","Новая","Новая","Новая","Новая","Новая","Новая"};
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_orders);

        TableLayout tableLayout = (TableLayout)findViewById(R.id.tableLayout);

        // первая строка
        for(int  i = 0; i < string_status.length ; i++){
            TableRow tableRow1 = new TableRow(this);

            TextView textView1 = new TextView(this);
            textView1.setText(""+string_date[i]);
            tableRow1.addView(textView1, new TableRow.LayoutParams(
                    TableRow.LayoutParams.WRAP_CONTENT, TableRow.LayoutParams.WRAP_CONTENT, 1.0f));

            TextView textView2 = new TextView(this);
            textView2.setText(""+string_state[i]);

            tableRow1.addView(textView2, new TableRow.LayoutParams(
                    TableRow.LayoutParams.WRAP_CONTENT, TableRow.LayoutParams.WRAP_CONTENT, 1.0f));

            Button textView3 = new Button(this);
            textView3.setText(""+string_status[i]);
            textView3.setTextSize(10);
            Intent intent = new Intent(this, InfoOrderActivity.class);
            textView3.setOnClickListener(new View.OnClickListener() {

                public void onClick(View v) {
                    // Обработка нажатия

                    startActivity(intent);
                }
            });
            tableRow1.addView(textView3, new TableRow.LayoutParams(
                    TableRow.LayoutParams.WRAP_CONTENT, TableRow.LayoutParams.WRAP_CONTENT, 1.0f));


            tableLayout.addView(tableRow1);
        }


    }
    public void onClick(View v) {

    }
}